Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: tunguutana
en: Fom1, tunguutaniza, ku-, oku-

source: obu babutikira omuntu antkutukumira ebyokwesweka bingi atunguutana
en: When you cover up a shiveringperson with many beddings he/ sbe will perspire

source: tunjka
en: To stretch, extend fully

source: kutunikira omuzaire 413 tuntumuk a ekifuba kitwarwa nk 'ekintu ky 'emigayo
en: Broadening of the chest to a parent is regarded contemptuous

source: tuntumuka
en: To grow very fast

source: akahuniirra kusanga emiti yabyaire omu mwaka gumu guti
en: Etunrumukire eri haiguru, he/she was surprised to find that within one year the trees he/she had planted had already matured

source: tuntura
en: To be troubled, anxious, worried

source: Mukama akatutanga kutunturuurra ebintu by 'ensi
en: The Lord stopped us from being weary of earthly things

source: tunuurra
en: To gaze at, behold

source: bakabasoboorra bazaire baabo ekyabatunuliize akanyonyi akembaganiza
en: They explained to their parents the reason why they gazed at the special bird

source: tura
en: To set out to work

source: abakozi ekibatuza nyenkyakara nukwo kusangwa baakora izooba litakatembere
en: The reason why workers set out very early to work is to see to it that by the time the sun gets high in the sky they would have gone a Iongway

source: turo
en: Cl. 9

source: turuka
en: To go or come out

source: orufu; orufu orw'omusaija baruturuk-ira ebiro bbina kandi orw 'omukazibisatu; anywire omubazi ogurukutun1kya; mulllrukye omulumbi; turul..ya omutamiizi natalibaniza abanlu; orufu rwe n1latun1kwe habwabandi abarwaire abakaba bali omuka
en: Go out of mourning, (the bereaved can now be free) akasaba mukama we amwikirize kugaruka hamulimo amazire kuturuka orufu rwa ise, he/she requested his/her master to allow him/her resume duty after he/she had come out of mourning his/her father'sdeath; It takes four days to come out of mourning for a deceased man and three for a woman; He/she has taken a laxative which has made him/her purge; Take the corpse out of the house (for speeches and burial); Take the drunkard out he/she is disturbing the people's peace; The deceased's funeral ceremony was not held because of the sick one at home

source: turukya
en: To bring or take out, eject

source: omuntu asisikaire enda aturukya orwoya rubi; akanga kuruga omwofiisi ye yayeta poliisi yamuturukya
en: One with a contaminated stomach brings out bad air; Be/she refused to come out of his/her office consequently be/she called the police which took him/ her out

source: turumuka
en: To be languid, slothful

source: omunt11 alakozesa mubiri gwe aikara aturumukire
en: A person who does not exercise his/her body is always slothful

source: turuotuka
en: To get out ofline, get in front

source: turuukana
en: To pass right through

source: kiba ky 'engeso mbi kutaaha enju y'omun tu okagit11ruukana otaina owoomunju weena akwebembiire
en: It is bad manners to enter one's house and then pass right through it without being guided by a member of the house

source: torukwikirizibwa kuturuukiriza omutwe gwawe omwidirisa /ya motoka erukwiruka
en: You are not allowed to stick out your bead through the window of a moving car

source: tutubara
en: To swell when soaked

source: tutubika
en: Togurgle

source: tutumbuka
en: To be bruised, have lumps on thebody,havescabies

source: (p f. -tutumbwire)
en: To cause lumps on the body

source: tuuba
en: To be gluttonous, voracious

source: tuukuurra
en: To undo (beadwork), untie. Tuum a, ku-, oku-, v.i

source: amaizi gatuumibwa omuurro ogw'amaani; ebisus11 obu obinaga omukiikaro kimu buli kiro bituuma
en: Water is made very hot when boiled by a strong fire. Tuum a, ku-, oku-, v.tr; When rubbish is poured in one place daily it heaps up

source: tuumuuka
en: Ascend (smoke)

source: tuura
en: To dwell, sigh

source: atwire hakyaro hanu kumara obusumi bwingi baitu titukahuurraaga ngu aibire; ekyamutwize hakyaro kyabo nukwo kutaiba bantu
en: He/she has been on this village for a long time but we have never heard that he/she bas stolen; The reason why he/ she has lived long on their village is that he/she never steals people's property

source: atarukusobora kwimuka kutuura omugenyi we; akasaba omuntu ondi aije amutuuze ekigega babagemuliire
en: Asaba omunlll ondi amumutuurre, he/she that is unable to standup and take a load off the head of his/her visitor will ask another person to do so for him/her; She asked another person to help her take off the basket of food that they brought to them as a present from the bead of its carrier

source: tuurra
en: To be sour, be spoilt (beer)

source: ebyenju ebyengere muno bitunaa amaarwa
en: Plantains that are too ripe make the beer sour, pass. Of c. Form, turuzibwa, ku-, oku-

source: ekihinzi bakakimutuliirra omubugenyi
en: They infected him/her with flu while at the party

source: tuurruuma
en: To be grumpy, grumble, growl

source: omuntu obu ahikaho embwa erukunena igufa; obu ohuurra embwa neetuurruuma
en: Etuurruuma, when a person approaches a dog that is biting a bone, it growls; Buli haroho omunt11 agisangire neenena igufa, when you hear a dog growling, it means that someone has found it biting a bone· pass. Of c. Form, t1111rr11umibwa, ku-: oku-

source: tuuta
en: To swell, be distended

source: nibagya klltuuta omusiri ogu baraabyaram11 ebitakuli
en: They are going to pile earth into moulds in the garden on which they will plant potato slips

source: tuutuka
en: To sweat, be in a perspiration

source: obu baamucumikiriire yatuutukira kim11 weena
en: When they gave him/her a steamed herb bath, he/she perspired the more

source: tuuya
en: To sweat

source: omusana gutuuyisa omuntu obu agukoorraamu emirimo
en: The sun beat will make a person sweat if he/she works under it

source: tuuza
en: To die (used of King only)

source: Omukama obu atuuza omuguta gwe gwnara ebiro mwenda gutakatabaaziibwe; Omukama Kaabaleega akatuuliza Jinja naan1ga omukuzaahisibwa
en: When a King dies, his corpse lies in state for nine days before it is buried; King Kaabaleega died while at Jinja on his way back from twa tyaza exile. Twa, o-, genitive particle for nouns in cl. 13. It is written separately before the noun butjoined with a possessive root and self standing pronoun

source: twalikana
en: To wrangle, quarrel, bicker

source: twalirirwa
en: To have a nap, be drowsy, doze up

source: ornubingi w'amotoka kutwalirirwa naabinga ky'akabi muno; akatwa/iririrwa ahingwire Kyegegwa
en: It is very dangerous for a motor driver to doze while he/she is driving; He/she dozed up after he/she had passed Kyegegwa

source: twaliriza
en: To go or do carefully or slowly

source: ornubazi akagunywa mpora natwaliriza yalindwa yagumaramu; orobazo rwe rokamutwaliriza yahinguza esaaha z 'okugamka omuka
en: He/she drunk the medicine slowly until he/she finally empted its container; He/she was so much engaged in talk such that he/she went beyond the time she was supposed to go back home

source: twara
en: To take, carry, conduct

source: twarraaniza
en: Root up together, give out two kinds of things

source: twaza
en: To drive, frighten off, take, help

source: tweka
en: To send, cause to conceive (by fornication)

source: twekera
en: To send to, to take to, carry

source: twekwa
en: To conceive (by fornication)

source: twengekeerra
en: To enlarge, add to, heighten, lengthen

source: abaleesi b 'amaizi abamu beetweka ensoha bagitwengekeerraaho akasisi k'amaizi; otunyansi otw 'omuroguudo hagati two
en: Some water collectors carry water-jars on their heads together with a small calabash full of water on top of it. Two, self-standing pron. For nouns in cl. 13; Tutahye, the scanty short grass in the middle of the road did not catch fire. Tyabira,ku, oku,v.i

source: tyagira
en: To trudge, plod along

source: tyagiza
en: To make a favourite of, pet

source: tyaguza
en: To stride along with springy step, walk with a spear, etc. (esp. A short person) in a warlike spirit

source: tyangya
en: -To brandish

source: tyaza
en: To sound (King's big drum)

source: amacumu bagatyaza nukwo galunge obwogi bw'okucumita; akabatanga kutyaliza amacumu gaabo haihyoro lye
en: Spears are sharpened in order that they may be able to pierce an animal easily; He stopped them from sharpening their spears on his whetstone

source: tyeruka
en: To break out (rash), sprout, grow up close together (e.g. Mushrooms)

source: omuntu libamuha mubazi gwona oruseru rutakatyerokire; obutuzi oburukwera butyen1ka habwokuba bumera kiswa kimu
en: A person is not given any medicine before measles has broken out; Button mushrooms grow up close together because they grow on the same ground

source: tyetyemura
en: To cut, tear

source: tyoka
en: To slip, slide, give way (as soil)

source: itaka erya harusa rw 'enguudo enjura nyingi obu egwa lityoka, Ligwa omuruguudo
en: The soil at the banks of a road slide to the road when it rains heavily

source: tyokora
en: To remove with a finger (usu., ghee, butter Vaseline). '

source: tyongoza
en: To point finger at (in defiance, scorn)

source: akaara omuliiso
en: Pass finger in front of face scornfully

source: omuti guli
en: That tree

source: Vv vanjiri
en: E-, 11., cl.9,, gospel

source: Vi
en: Intensive with okukwata = hold finnly. Viini, e-, n., wine.

source: vikiza
en: To bold firmly

source: Sabbunni y'ensaano y 'okwogiisa ebintu
en: Soap in powder form for cleaning utensils

source: wa
en: Of rules governing its l.V. And its last vowel are explained in Modem Runyoro-Rutooro Grammer, Koln Koppe 1999. Waabu, o-, n. Cl.I,, relative

source: akafa nk'omuntu ataina waabu
en: Be/she died like one without a relative. Waaha, word of negative (definable)

source: wabimbiri
en: Viper

source: waihuru
en: Very large carrion-eating bird

source: waikiriiraha
en: Growth left unburnt after grass fire

source: waimiri
en: Nest of the black tree ant

source: Waizikya
en: Ogre, giant, monster, mythical cannibal

source: Wakame
en: Mr. Hare, Brer Rabbit

source: wakonga
en: Pangolin, scaly ant-eater

source: Wamara
en: Name of the last omucwezi King of Kitara

source: wania
en: Inflamed breasts, abscess of the breast

source: wankuura
en: Plant with yellow flowers (rather like primerose)

source: wansazi
en: Fast asleep at night, "Beauty sleep"

source: oturo akwijagiire twawansazi
en: He has had beauty sleep.

source: weebumbe
en: Sensitive plant when touched it collects its leaves

source: Wceb holeke
en: Beet that has stood for four or five days

source: weesorole
en: Flock of large birds seen in November, locust birds

source: Weewe weza
en: Thou! You there! Right you are, that was the truth
